<?php

// +----------------------------------------------------------------------
// | laravelvip 乐融沃B2B2C商城系统
// +----------------------------------------------------------------------
// | Copyright (c) 2017-2027 http://www.laravelvip.com All rights reserved.
// +----------------------------------------------------------------------
// | Notice: This code is not open source, it is strictly prohibited
// |         to distribute the copy, otherwise it will pursue its
// |         legal responsibility.
// +----------------------------------------------------------------------
// | 版权所有 2015-2027 云南乐融沃网络科技有限公司，并保留所有权利。
// | 网站地址: http://www.laravelvip.com
// +----------------------------------------------------------------------
// | 这不是一个自由软件！禁止拷贝本软件副本，否则将追究其法律责任！
// | 如需使用，请移步官网购买正版授权。
// +----------------------------------------------------------------------
// | Author: 雲溪荏苒 <290648237@qq.com>
// | Date:2019-5-15
// | Description:平台进出账明细
// +----------------------------------------------------------------------

namespace App\Repositories;

use App\Models\MallAccount;

class MallAccountRepository
{
    use BaseRepository;

    protected $model;


    public function __construct()
    {
        $this->model = new MallAccount();
    }

    /*
     * 说明：
     * account_type：账户分类
     *  // 进账
        101-购物在线支付交易收入
        102-充值
        103-保证金和使用费
        104-续缴平台使用费
        105-神码收银
        // 106-余额支付退款         注：无用
        // 107-余额支付取消订单     注：无用
        108-人为调整-增加
        109-在线支付购买短信
        110-站点加盟费
        111-平台储值卡充值
        112-支付宝退款

        // 出账
        // 201-购物余额支付交易支出   注：无用
        202-在线支付退款
        203-在线支付取消订单
        204-站点扣点
        205-提现
        206-人为调整-减少
     */
}
