<?php

// +----------------------------------------------------------------------
// | laravelvip 乐融沃B2B2C商城系统
// +----------------------------------------------------------------------
// | Copyright (c) 2017-2027 http://www.laravelvip.com All rights reserved.
// +----------------------------------------------------------------------
// | Notice: This code is not open source, it is strictly prohibited
// |         to distribute the copy, otherwise it will pursue its
// |         legal responsibility.
// +----------------------------------------------------------------------
// | 版权所有 2015-2027 云南乐融沃网络科技有限公司，并保留所有权利。
// | 网站地址: http://www.laravelvip.com
// +----------------------------------------------------------------------
// | 这不是一个自由软件！禁止拷贝本软件副本，否则将追究其法律责任！
// | 如需使用，请移步官网购买正版授权。
// +----------------------------------------------------------------------
// | Author: 雲溪荏苒 <290648237@qq.com>
// | Date:2019-5-14
// | Description:会员账户明细
// +----------------------------------------------------------------------

namespace App\Repositories;

use App\Models\UserAccount;

class UserAccountRepository
{
    use BaseRepository;

    protected $model;


    public function __construct()
    {
        $this->model = new UserAccount();
    }

    /*
     * 说明：
     * process_type：账户变动类型
     *      1-充值
            4-提现
            5-调节账户资金
            8-购物-余额支付
            10-取消-余额支付
            11-退款-余额支付
            15-推荐分成
            16-撤销推荐分成
            17-分销账户提现到余额
            18-拒绝提现
            19-平台结算进账
            20-神码收银
            21-购买短信
            22-储值卡充值
            23-退款成功退还运费
            24-取消提现
            25-线下消费余额
            26-提现手续费
            27-线下收款
     */
}
